import React from 'react';

const TwitterIcon = () => {
    return (
<svg className='social-icon' data-name='Слой 1' xmlns='http://www.w3.org/2000/svg'
viewBox='0 0 83 83'>
    <defs />
    <rect id='rect146' className='tw-1' width='80' height='80' />
    <rect id='rect148' className='tw-2' width='80' height='80' x='2' y='2' rx='20' ry='20'
    />
    <path id='path150' className='tw-3' d='M60.29,32.74c0,.39,0,.79,0,1.19,0,12.17-9.26,26.19-26.2,26.19A26,26,0,0,1,20,56a17.68,17.68,0,0,0,2.2.13,18.46,18.46,0,0,0,11.43-3.94,9.22,9.22,0,0,1-8.6-6.4,9,9,0,0,0,1.73.17,9.26,9.26,0,0,0,2.43-.32,9.23,9.23,0,0,1-7.39-9v-.11A9.34,9.34,0,0,0,26,37.64a9.25,9.25,0,0,1-2.85-12.3,26.14,26.14,0,0,0,19,9.63,9.21,9.21,0,0,1,15.69-8.4,18.59,18.59,0,0,0,5.85-2.24,9.29,9.29,0,0,1-4.06,5.1A18.57,18.57,0,0,0,64.88,28a18.71,18.71,0,0,1-4.59,4.76Z'
    transform='translate(-2.01 -1.66)' />
</svg>
    )
}

export default TwitterIcon;